gadya.tex
% Created 2015-12-31 Thu 23:13
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[parfill]{parskip}
\setlength{\oddsidemargin}{0cm}
\setlength{\evensidemargin}{0cm}
\setlength{\topmargin}{0cm}
\addtolength{\topmargin}{-\headheight}
\addtolength{\topmargin}{-\headsep}
\setlength{\textheight}{22.6cm}
\setlength{\textwidth}{16.51cm}
\setlength{\marginparwidth}{1.27cm}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.2)}, 
 pdflang={English}}
\begin{document}

\pagenumbering{roman}
\setcounter{tocdepth}{3}
\tableofcontents
\newpage
\pagenumbering{arabic}

\section{The problem we are trying to solve}
\label{sec:orgheadline1}
Right now most of the literate programming solutions require either a specific
editor or work only in the framework of a specific language. Thus we'd like to
have an editor agnostic and language agnostic way of doing literate programming.
Of course there are language agnostic tools to do literate programming and they
certainly will be used as a reference point for our solution. We also will take
a look at them and how to use them with the editors vim and/or emacs. Another
feature we want to have is syntax highlighting and fast feedback of the written
code (i.e. compile->execute, repl). Thus it's desirable to write code as we are
used to. But how is that literate programming? So we need to solve the problem
of untangling the written code to merge it with the documentation, that we
then can weave.

\section{First idea}
\label{sec:orgheadline4}
We want to write code as we are used to, but we also want to document the
why and how of the code in terms of literate programming. To do this we define
a language whose symbols are used in the code's comments to specify code
fragements. An example using Go\footnote{\url{https://golang.org/}} as programming language:

\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{go}
//@scrap name [OPTS]
func doSomething() {
...
}
//@scrap
\end{minted}

The @scrap directive is used to mark a named section of the written code
which then can be used in the documentation to refer to this code. Here an
example:

\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{latex}
We do something because of this.
@file name [OPTS]
@{<<scrap-name>>@}
\end{minted}

The @file directive specifies the file to which the code listing belongs, 
indicated by @\{ and @\}. In a listing we can then reference scraps defined in
this code file or other code files.

But this raises some further questions:
\begin{itemize}
\item How to avoid name clashes if we have scraps that are named the same but
are defined in different files?
\begin{itemize}
\item Namespaces? i.e. ns.scrap-name
\end{itemize}
\end{itemize}

\subsection{Let's try that}
\label{sec:orgheadline3}
We are going to write a quick 'n dirty prototype to get a feel for the
above idea. For that we're using Racket\footnote{\url{http://racket-lang.org/}}, because it allows for rapid
prototyping through its REPL, standard library and very good documentation.

\subsubsection{The example code and documentation}
\label{sec:orgheadline2}
As an example language, for the code we want to document, we will use Go.
The example code:

\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{go}
package main

import "fmt"

//@scrap print_to_stdout
func doSomething() {
  fmt.Println("Hello world")
}
//@scrap

func main() {
  doSomething()
}
\end{minted}

And the documentation contains the following:

\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{latex}
Testing an idea:
@file example.go
@{<<print_to_stdout@}
\end{minted}

\section{Existing tools in the literate programming world}
\label{sec:orgheadline12}
In this section we're going to take a closer look at two language agnostic
tools that facilitate literate programming, and the powerful emacs+org-mode
combination. In the last part of the section
we peek at other tools and editors for specific languages. We do this to see
how literate programming is being done with these tools and to get some ideas
on how we can solve our stated problem. Note that there a many other tools
out there. A broader list of tools can be found at \href{http://www.literateprogramming.com/tools.html}{literateprogramming.com}.

Why not WEB or CWEB, they are the source of literate programming? Both of
them are bound to a specific language. The former Pascal+Latex and the latter
C+Latex. And they are fairly complex. Furthermore is noweb heavily influnced
by these two thus it should suffice to only consider noweb and because we are
want to have a language agnostic solution. And we take a closer look at nuweb
because it has a fairly lightweight directive set compared to noweb.

\subsection{noweb}
\label{sec:orgheadline5}
\subsection{nuweb}
\label{sec:orgheadline6}
\subsection{emacs + org-mode}
\label{sec:orgheadline7}
\subsection{Others}
\label{sec:orgheadline11}
\subsubsection{Scribble}
\label{sec:orgheadline8}
Scribble\footnote{\url{http://docs.racket-lang.org/scribble/}} is a documentation tool that can output the resulting document
in HTML, LaTex and other formats. It's mainly used to produce the Racket
documentation. It's quite easy to learn and one can use functions defined
in Racket to insert results in the document. This is a powerful feature
and might also allow for the possibility to implement a more sophisticated
literate programming tool than the scribble/lp2\footnote{\url{http://docs.racket-lang.org/scribble/lp.html}} module, which is limited to 
racket.
\subsubsection{literate-programming}
\label{sec:orgheadline9}
\subsubsection{Sweave}
\label{sec:orgheadline10}
\end{document}
